### **Abrindo arquivos com pandas**

In [4]:
import pandas as pd
dados = pd.read_csv("D:\Documentos\Carrinhos.csv")

In [5]:
display(dados) # carrega toda a tabela

                              Modelo;Marca;Colecao;Cor
0    USS Enterprise NCC-1701;Hot Wheels;Mainline;Br...
1              USS Vengeance;Hot Wheels;Mainline;Cinza
2               Datsun 240z;Hot Wheels;Mainline;Branco
3             Blook O' Wood;Hot Wheels;Mainline;Branco
4               Datsun 620;Hot Wheels;Mainline;Laranja
..                                                 ...
377             Toyota Tacoma;Hot Wheels;Mainline;Azul
378     Ford Sierra Cosworth;Hot Wheels;Mainline;Preto
379                 59 Impala;Hot Wheels;Mainline;Rosa
380                 RAM 2500;Hot Wheels;Mainline;Cinza
381          Mustang Mach E;Hot Wheels;Mainline;Branco

[382 rows x 1 columns]

In [6]:
dados.head(10) # carrega as 10 primeiras linhas

                            Modelo;Marca;Colecao;Cor
0  USS Enterprise NCC-1701;Hot Wheels;Mainline;Br...
1            USS Vengeance;Hot Wheels;Mainline;Cinza
2             Datsun 240z;Hot Wheels;Mainline;Branco
3           Blook O' Wood;Hot Wheels;Mainline;Branco
4             Datsun 620;Hot Wheels;Mainline;Laranja
5              Mustang Drag;Hot Wheels;Mainline;Azul
6              1970 Camaro;Hot Wheels;Mainline;Verde
7           Meyers Manx;Hot Wheels;Mainline;Vermelho
8     Surfing School Bus;Hot Wheels;Mainline;Amarelo
9        Hiway Hauler 2;Hot Wheels;Mainline;Vermelho

### **Criando Dataframe com pandas**

In [7]:
import pandas as pd
alunos = {'Nome':['Jose', 'Maria', 'Joao', 'Pedro'],
          'Nota':[4, 7, 5.5, 9],
          'Aprovado':['Nao', 'Sim', 'Nao', 'Sim']}

In [8]:
dataframe = pd.DataFrame(alunos)
print(dataframe)

    Nome  Nota Aprovado
0   Jose   4.0      Nao
1  Maria   7.0      Sim
2   Joao   5.5      Nao
3  Pedro   9.0      Sim

### **Comando Series**

In [9]:
objeto1 = pd.Series([2, 6, 9, 10, 5])
print(objeto1)

0     2
1     6
2     9
3    10
4     5
dtype: int64

In [10]:
import numpy as np
array = np.array([(2, 6, 9, 10, 5), (6, 12, 2, 9, 10)])
print(array)

[[ 2  6  9 10  5]
 [ 6 12  2  9 10]]

### **Comandos uteis do panda**

In [11]:
import pandas as pd
alunos_dic = {'Nome':['Jose', 'Maria', 'Joao', 'Pedro'],
          'Nota':[4, 7, 5.5, 9],
          'Aprovado':['Nao', 'Sim', 'Nao', 'Sim']}

In [12]:
alunos_df = pd.DataFrame(alunos_dic)
print(alunos_df)

print("\n")

alunos_df.head() # Formata a tabela

    Nome  Nota Aprovado
0   Jose   4.0      Nao
1  Maria   7.0      Sim
2   Joao   5.5      Nao
3  Pedro   9.0      Sim

    Nome  Nota Aprovado
0   Jose   4.0      Nao
1  Maria   7.0      Sim
2   Joao   5.5      Nao
3  Pedro   9.0      Sim

In [13]:
alunos_df.shape # Mostra quantas linhas e colunas tem o dataframe

(4, 3)

### **Metodo Describe**

Demonstra as informaÃ§oes automaticamente dos dataframes.

In [14]:
alunos_df.describe()

           Nota
count  4.000000
mean   6.375000
std    2.136001
min    4.000000
25%    5.125000
50%    6.250000
75%    7.500000
max    9.000000

### **Filtros de um dataframe- Slice**

In [15]:
alunos_df['Nome'] # Filtro de uma coluna

0     Jose
1    Maria
2     Joao
3    Pedro
Name: Nome, dtype: object

In [16]:
alunos_df.loc[[0,2]] # Filtro de uma linha

   Nome  Nota Aprovado
0  Jose   4.0      Nao
2  Joao   5.5      Nao

In [17]:
alunos_df.loc[ alunos_df['Nome']=='Jose']

   Nome  Nota Aprovado
0  Jose   4.0      Nao

### **Manipulando linha do DataFrame**

In [18]:
primeiraslinhas = alunos_df.loc[0:2]
print(primeiraslinhas)

    Nome  Nota Aprovado
0   Jose   4.0      Nao
1  Maria   7.0      Sim
2   Joao   5.5      Nao

# **Manipulando colunas do DataFrame**

In [19]:
import pandas as pd
dados_mini = pd.read_excel("D:\Documentos\CARRINHOS.xlsx")
display(dados_mini)

                      Modelo       Marca   Colecao      Cor
0    USS Enterprise NCC-1701  Hot Wheels  Mainline   Branco
1              USS Vengeance  Hot Wheels  Mainline    Cinza
2                Datsun 240z  Hot Wheels  Mainline   Branco
3              Blook O' Wood  Hot Wheels  Mainline   Branco
4                 Datsun 620  Hot Wheels  Mainline  Laranja
..                       ...         ...       ...      ...
377            Toyota Tacoma  Hot Wheels  Mainline     Azul
378     Ford Sierra Cosworth  Hot Wheels  Mainline    Preto
379                59 Impala  Hot Wheels  Mainline     Rosa
380                 RAM 2500  Hot Wheels  Mainline    Cinza
381           Mustang Mach E  Hot Wheels  Mainline   Branco

[382 rows x 4 columns]

### **Renomeando colunas**

In [20]:
dados_mini.rename(columns = {'Modelo':'Model','Marca':'Brand','Colecao':'Collection','Cor':'Color'})

                       Model       Brand Collection    Color
0    USS Enterprise NCC-1701  Hot Wheels   Mainline   Branco
1              USS Vengeance  Hot Wheels   Mainline    Cinza
2                Datsun 240z  Hot Wheels   Mainline   Branco
3              Blook O' Wood  Hot Wheels   Mainline   Branco
4                 Datsun 620  Hot Wheels   Mainline  Laranja
..                       ...         ...        ...      ...
377            Toyota Tacoma  Hot Wheels   Mainline     Azul
378     Ford Sierra Cosworth  Hot Wheels   Mainline    Preto
379                59 Impala  Hot Wheels   Mainline     Rosa
380                 RAM 2500  Hot Wheels   Mainline    Cinza
381           Mustang Mach E  Hot Wheels   Mainline   Branco

[382 rows x 4 columns]

### **Contagem de itens nas coluna**

In [21]:
dados_mini['Marca'].value_counts()

Hot Wheels    378
Matchbox        3
JADA TOYS       1
Name: Marca, dtype: int64

In [22]:
dados_mini['Cor'].value_counts()

Azul        74
Vermelho    67
Branco      51
Cinza       37
Verde       35
Amarelo     33
Preto       30
Laranja     25
Roxo        16
Dourado      7
Marrom       3
Bege         2
verde        1
Rosa         1
Name: Cor, dtype: int64

### **Excluindo uma coluna**

In [23]:
dados_mini.drop('Marca', axis = 1, inplace = True)
dados_mini.drop('Colecao', axis = 1, inplace = True)

In [24]:
dados_mini.head()

                    Modelo      Cor
0  USS Enterprise NCC-1701   Branco
1            USS Vengeance    Cinza
2              Datsun 240z   Branco
3            Blook O' Wood   Branco
4               Datsun 620  Laranja